#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.lambda.data.archive_file.lambda: Reading...
module.lambda.data.archive_file.lambda: Read complete after 0s [id=961df6c7267b298a2f7d86250a5bbc5f4263c442]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Reading...
module.secrets.aws_secretsmanager_secret.auth: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:auth-secret-IJnog4]
module.ecs.aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:cluster/soat1-grp13-tech-challenge]
module.bastion-ec2.aws_eip.ec2-bastion-host-eip: Refreshing state... [id=eipalloc-0a8f59a0549cb343f]
module.databases.aws_dynamodb_table.loggedUsers: Refreshing state... [id=usuariosLogados]
module.secrets.aws_secretsmanager_secret.produto: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:produto-secret-C3RUkM]
module.secrets.aws_secretsmanager_secret.pedido: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:pedido-secret-oL00lC]
module.secrets.aws_secretsmanager_secret.producao: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:producao-secret-6PqqvE]
module.lambda.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
module.apigw.aws_apigatewayv2_api.apigw_http_endpoint: Refreshing state... [id=rhy38e3w12]
module.ecs.data.aws_iam_policy_document.task_exec_assume: Read complete after 0s [id=2291109037]
module.s3.aws_s3_bucket.lambda_s3: Refreshing state... [id=tech-challenge-soat1-grp13-s3-auth]
module.secrets.aws_secretsmanager_secret.pagamento: Refreshing state... [id=arn:aws:secretsmanager:us-west-2:834794241069:secret:pagamento-secret-KCV9bx]
module.networking.aws_vpc.vpc: Refreshing state... [id=vpc-0bf4922eb738e7735]
module.ecs.aws_iam_role.task_exec: Refreshing state... [id=taskRole]
module.lambda.aws_lambda_function.authorizer_lambda: Refreshing state... [id=techChallenge-authorizer]
module.apigw.aws_apigatewayv2_stage.apigw_stage: Refreshing state... [id=$default]
module.ecs.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/ecs/soat1-grp13-tech-challenge]
module.ecs.aws_ecs_cluster_capacity_providers.this: Refreshing state... [id=soat1-grp13-tech-challenge]
module.ecs.aws_ecs_task_definition.pedido: Refreshing state... [id=pedido-api]
module.ecs.aws_ecs_task_definition.produto: Refreshing state... [id=produto-api]
module.ecs.aws_ecs_task_definition.producao: Refreshing state... [id=producao-api]
module.ecs.aws_iam_role_policy_attachment.default: Refreshing state... [id=taskRole-20240120121139982100000001]
module.ecs.aws_ecs_task_definition.pagamento: Refreshing state... [id=pagamento-api]
module.ecs.aws_ecs_task_definition.auth: Refreshing state... [id=auth-api]
module.ecs.data.aws_iam_policy_document.task_exec: Reading...
module.ecs.data.aws_iam_policy_document.task_exec: Read complete after 0s [id=2255285640]
module.ecs.aws_iam_policy.policy: Refreshing state... [id=arn:aws:iam::834794241069:policy/getSecretELog]
module.apigw.aws_lambda_permission.my_authorizer_lambda_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
module.apigw.aws_apigatewayv2_authorizer.apigw_authorizer: Refreshing state... [id=kx5a88]
module.ecs.aws_iam_role_policy_attachment.task_exec_additional: Refreshing state... [id=taskRole-20240120121149113600000002]
module.networking.aws_subnet.private_subnet[1]: Refreshing state... [id=subnet-00fb42fda3d060170]
module.alb.aws_security_group.egress_all: Refreshing state... [id=sg-088b52fdf3cededd9]
module.networking.aws_internet_gateway.ig: Refreshing state... [id=igw-061f4b55063e31796]
module.networking.aws_subnet.public_subnet[0]: Refreshing state... [id=subnet-0f0f9fc7435793705]
module.networking.aws_subnet.public_subnet[1]: Refreshing state... [id=subnet-009452c41028de330]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-07c13ac5667702150]
module.networking.aws_subnet.private_subnet[0]: Refreshing state... [id=subnet-09a81c140448acf62]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0776349fe1086794e]
module.networking.aws_security_group.tech_challenge_sg: Refreshing state... [id=sg-008d2302846ddea69]
module.alb.aws_security_group.http: Refreshing state... [id=sg-0f943a4d92ffbf178]
module.ecs.aws_security_group.ecs_sg: Refreshing state... [id=sg-03144824b14051a6a]
module.bastion-ec2.aws_security_group.ec2-bastion-sg: Refreshing state... [id=sg-04955dfab705e8987]
module.alb.aws_security_group.ingress_api: Refreshing state... [id=sg-071957e3651056eb4]
module.alb.aws_security_group.https: Refreshing state... [id=sg-0c3282a2994e9b337]
module.networking.aws_eip.nat_eip: Refreshing state... [id=eipalloc-03efda12b926fccd5]
module.networking.aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-07c13ac56677021501080289494]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0ae43c4697d679206]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-00c6ff140916e35d2]
module.networking.aws_db_subnet_group.db_subnet: Refreshing state... [id=db_subnet_group]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-058da63563bcd9ffb]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-08b14b2d95111cae2]
module.databases.aws_security_group.rds-postgres-sg: Refreshing state... [id=sg-0877ffd549745f766]
module.bastion-ec2.aws_instance.ec2-bastion-host: Refreshing state... [id=i-0193ed72257c0ec8d]
module.apigw.aws_apigatewayv2_vpc_link.vpclink_apigw_to_alb: Refreshing state... [id=dj68fi]
module.alb.aws_lb.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:loadbalancer/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f]
module.networking.aws_nat_gateway.nat: Refreshing state... [id=nat-022cce9106b56a680]
module.networking.aws_route.private_nat_gateway: Refreshing state... [id=r-rtb-0776349fe1086794e1080289494]
module.databases.aws_db_instance.postgresql_db: Refreshing state... [id=db-XFYCL4FC3FOGS2BGXKDVDYWBQI]
module.alb.aws_lb_target_group.produto: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/produto-tg/42bc348c1884a750]
module.alb.aws_lb_target_group.pedido: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/pedido-tg/12762aab6de02882]
module.alb.aws_lb_target_group.pagamento: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/pagamento-tg/6b28883c280ec6f3]
module.alb.aws_lb_target_group.producao: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/producao-tg/08820db6f6498194]
module.alb.aws_lb_target_group.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:targetgroup/auth-tg/9925cc7358a54076]
module.ecs.aws_ecs_service.produto: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/produto-service]
module.ecs.aws_ecs_service.pedido: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/pedido-service]
module.ecs.aws_ecs_service.pagamento: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/pagamento-service]
module.alb.aws_lb_listener.this: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97]
module.ecs.aws_ecs_service.producao: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/producao-service]
module.ecs.aws_ecs_service.auth: Refreshing state... [id=arn:aws:ecs:us-west-2:834794241069:service/soat1-grp13-tech-challenge/auth-service]
module.alb.aws_lb_listener_rule.pagamento: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97/2262f614cd5d36f0]
module.alb.aws_lb_listener_rule.pedido: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97/fbdfcf60402c5f41]
module.alb.aws_lb_listener_rule.producao: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97/c3a6e946ea6c8eaf]
module.alb.aws_lb_listener_rule.produto: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97/fd2b8d6026ba5d4e]
module.alb.aws_lb_listener_rule.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-west-2:834794241069:listener-rule/app/techchallengeasoat1grp13alb/67d6ab9ff0fba43f/8812f03b2804bf97/b4b1e2d1219f4b20]
module.apigw.aws_apigatewayv2_integration.apigw_integration: Refreshing state... [id=k1ei52i]
module.bastion-ec2.aws_eip_association.ec2-bastion-host-eip-association: Refreshing state... [id=eipassoc-00a707b50953339bf]
module.apigw.aws_apigatewayv2_route.auth_route: Refreshing state... [id=1mle7yr]
module.apigw.aws_apigatewayv2_route.catalogo_route: Refreshing state... [id=gyw2guq]
module.apigw.aws_apigatewayv2_route.producao_route: Refreshing state... [id=h3g62nq]
module.apigw.aws_apigatewayv2_route.pedido_route: Refreshing state... [id=61m9s69]
module.apigw.aws_apigatewayv2_route.pagamento_route: Refreshing state... [id=syfq4gn]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.bastion-ec2.aws_instance.ec2-bastion-host has changed
  ~ resource "aws_instance" "ec2-bastion-host" {
        id                                   = "i-0193ed72257c0ec8d"
      + public_dns                           = "ec2-34-210-59-120.us-west-2.compute.amazonaws.com"
        tags                                 = {
            "Name"    = "ec2-bastion-host-dev"
            "Produto" = "geral"
        }
        # (31 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.databases.aws_dynamodb_table.pedidos will be created
  + resource "aws_dynamodb_table" "pedidos" {
      + arn                         = (known after apply)
      + billing_mode                = "PAY_PER_REQUEST"
      + deletion_protection_enabled = false
      + hash_key                    = "pedidoId"
      + id                          = (known after apply)
      + name                        = "pedidosPagos"
      + read_capacity               = (known after apply)
      + stream_arn                  = (known after apply)
      + stream_enabled              = false
      + stream_label                = (known after apply)
      + stream_view_type            = (known after apply)
      + tags                        = {
          + "Environment" = "dev"
          + "Name"        = "DynamoDB-usuarios"
        }
      + tags_all                    = {
          + "Environment" = "dev"
          + "Name"        = "DynamoDB-usuarios"
        }
      + write_capacity              = (known after apply)

      + attribute {
          + name = "pedidoId"
          + type = "S"
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }

      + ttl {
          + attribute_name = "ttl"
          + enabled        = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ ec2-dns            = "" -> "ec2-34-210-59-120.us-west-2.compute.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @luiz-soh, Action: `pull_request`*